
####################################################################################
# Constraints
# ----------------------------------------------------------------------------
#
# 0. Design Compiler variables
#
# 1. Master Clock Definitions
#
# 2. Generated Clock Definitions
#
# 3. Clock Uncertainties
#
# 4. Clock Latencies 
#
# 5. Clock Relationships
#
# 6. set input/output delay on ports
#
# 7. Driving cells
#
# 8. Output load

####################################################################################
           #########################################################
                  #### Section 0 : DC Variables ####
           #########################################################
#################################################################################### 

# Prevent assign statements in the generated netlist (must be applied before compile command)
set_fix_multiple_port_nets -all -buffer_constants -feedthroughs

####################################################################################
           #########################################################
                  #### Section 1 : Clock Definition ####
           #########################################################
#################################################################################### 
# 1. Master Clock Definitions 
# 2. Generated Clock Definitions
# 3. Clock Latencies
# 4. Clock Uncertainties
# 4. Clock Transitions
####################################################################################



set REF_CLK_NAME  REF_CLK
set UART_CLK_NAME UART_CLK


set REF_CLK_PER  100
#set UART_CLK_PER 271.296
set UART_CLK_PER 350

set CLK_SETUP_SKEW 0.2
set CLK_HOLD_SKEW 0.1

set CLK_LAT 0

set CLK_RISE 0.1
set CLK_FALL 0.1




create_clock -name $REF_CLK_NAME  -period $REF_CLK_PER  -waveform "0 [expr $REF_CLK_PER/2]" [get_ports REF_CLK]
set_clock_uncertainty -setup $CLK_SETUP_SKEW [get_clocks $REF_CLK_NAME]
set_clock_uncertainty -hold  $CLK_HOLD_SKEW  [get_clocks $REF_CLK_NAME]
set_clock_latency   $CLK_LAT  [get_clocks $REF_CLK_NAME]


create_clock -name $UART_CLK_NAME -period $UART_CLK_PER -waveform "0 [expr $UART_CLK_PER/2]" [get_ports UART_CLK]
set_clock_uncertainty -setup $CLK_SETUP_SKEW [get_clocks $UART_CLK_NAME]
set_clock_uncertainty -hold  $CLK_HOLD_SKEW  [get_clocks $UART_CLK_NAME]
set_clock_latency   $CLK_LAT  [get_clocks $UART_CLK_NAME]




set_dont_touch_network REF_CLK
set_dont_touch_network UART_CLK
set_dont_touch_network RST




create_generated_clock -master_clock "REF_CLK" -source [get_port REF_CLK] -name "ALU_CLK" [get_port CLK_GATE_dut/ECK] -divide_by 1
set_clock_uncertainty -setup $CLK_SETUP_SKEW [get_clocks ALU_CLK]
set_clock_uncertainty -hold  $CLK_HOLD_SKEW  [get_clocks ALU_CLK]
set_clock_latency   $CLK_LAT  [get_clocks ALU_CLK]



create_generated_clock -master_clock "UART_CLK" -source [get_port UART_CLK] -name "RX_CLK" [get_port CLK_DIV_RX_dut/o_div_clk] -divide_by 1
set_clock_uncertainty -setup $CLK_SETUP_SKEW [get_clocks RX_CLK]
set_clock_uncertainty -hold  $CLK_HOLD_SKEW  [get_clocks RX_CLK]
set_clock_latency   $CLK_LAT  [get_clocks RX_CLK]



create_generated_clock -master_clock "UART_CLK" -source [get_port UART_CLK] -name "TX_CLK" [get_port CLK_DIV_TX_dut/o_div_clk] -divide_by 32
set_clock_uncertainty -setup $CLK_SETUP_SKEW [get_clocks TX_CLK]
set_clock_uncertainty -hold  $CLK_HOLD_SKEW  [get_clocks TX_CLK]
set_clock_latency   $CLK_LAT  [get_clocks TX_CLK]


####################################################################################
           #########################################################
             #### Section 2 : Clocks Relationship ####
           #########################################################
####################################################################################


set_clock_groups -asynchronous -group {UART_CLK} -group {REF_CLK}
set_clock_groups -asynchronous -group [get_clocks {TX_CLK  RX_CLK}]   -group [get_clocks {REF_CLK}]
set_clock_groups -asynchronous -group [get_clocks {UART_CLK  TX_CLK}] -group [get_clocks {REF_CLK}] 
set_clock_groups -asynchronous -group [get_clocks {UART_CLK  RX_CLK}] -group [get_clocks {REF_CLK}]

####################################################################################
           #########################################################
             #### Section 3 : set input/output delay on ports ####
           #########################################################
####################################################################################

set in1_delay  [expr 0.2*$REF_CLK_PER]
set out1_delay [expr 0.2*$REF_CLK_PER]

set in2_delay  [expr 0.2*$UART_CLK_PER]
set out2_delay [expr 0.2*$UART_CLK_PER]




#CONSTRAIN INPUT PATHS

set_input_delay $in2_delay -clock RX_CLK [get_port RX_IN]

#CONSTRAIN OUTPUT PATHS

set_output_delay $out2_delay -clock TX_CLK [get_port TX_OUT]


####################################################################################
           #########################################################
                  #### Section 4 : Driving cells ####
           #########################################################
####################################################################################

set_driving_cell -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -lib_cell BUFX2M -pin Y [get_port RX_IN]


####################################################################################
           #########################################################
                  #### Section 5 : Output load ####
           #########################################################
####################################################################################

set_load 0.5 [get_port TX_OUT]

####################################################################################
           #########################################################
                 #### Section 6 : Operating Condition ####
           #########################################################
####################################################################################

# Define the Worst Library for Max(#setup) analysis
# Define the Best Library for Min(hold) analysis

set_operating_conditions -min_library "scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c" -min "scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c" -max_library "scmetro_tsmc_cl013g_rvt_ss_1p08v_125c" -max "scmetro_tsmc_cl013g_rvt_ss_1p08v_125c"

####################################################################################
           #########################################################
                  #### Section 7 : wireload Model ####
           #########################################################
####################################################################################

#set_wire_load_model -name tsmc13_wl30 -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c

####################################################################################


